Documents/РегистрацияИнцидента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>РегистрацияИнцидента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Инциденты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИнцидента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пропуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропуска</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропускаНаТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерьезностьИнцидента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РегистрацияИнцидента/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Клиентская процедура при открытии формы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ОбновитьОтображениеСерьезности();
    УстановитьТекущуюДатуИнициализации();
КонецПроцедуры

// Клиентская процедура при изменении ФизическоеЛицо
&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
    Если Не ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда
        Предупреждение("Поле Физическое лицо обязательно для заполнения!");
    КонецЕсли;
КонецПроцедуры

// Клиентская процедура при изменении ТочкаКонтроля
&НаКлиенте
Процедура ТочкаКонтроляПриИзменении(Элемент)
    Если Не ЗначениеЗаполнено(Объект.ТочкаКонтроля) Тогда
        Предупреждение("Поле Точка контроля обязательно для заполнения!");
    КонецЕсли;
КонецПроцедуры

// Клиентская процедура при изменении ДатаИнцидента
&НаКлиенте
Процедура ДатаИнцидентаПриИзменении(Элемент)
    Если Не ЗначениеЗаполнено(Объект.ДатаИнцидента) Тогда
        Предупреждение("Поле Дата инцидента обязательно для заполнения!");
        Возврат;
    КонецЕсли;

    ТекущаяДата = ТекущаяДата();
    Если Объект.ДатаИнцидента > ТекущаяДата Тогда
        Предупреждение("Дата инцидента не может быть в будущем! Установите дату не позднее " + Формат(ТекущаяДата, "ДФ='dd.MM.yyyy HH:mm'") + ".");
        Объект.ДатаИнцидента = ТекущаяДата;
    КонецЕсли;
КонецПроцедуры

// Клиентская процедура при изменении СерьезностьИнцидента
&НаКлиенте
Процедура СерьезностьИнцидентаПриИзменении(Элемент)
    ОбновитьОтображениеСерьезности();
КонецПроцедуры

// Устанавливаем текущую дату при открытии формы, если дата не заполнена
&НаКлиенте
Процедура УстановитьТекущуюДатуИнициализации()
    Если Не ЗначениеЗаполнено(Объект.ДатаИнцидента) Тогда
        Объект.ДатаИнцидента = ТекущаяДата();
    КонецЕсли;
КонецПроцедуры

// Обновляем отображение уровня серьезности
&НаКлиенте
Процедура ОбновитьОтображениеСерьезности()
    УровеньСерьезности = ПолучитьУровеньСерьезности(Объект.СерьезностьИнцидента);
    Элементы.НадписьСерьезность.Заголовок = ?(ЗначениеЗаполнено(УровеньСерьезности), УровеньСерьезности, "SEV-3");
КонецПроцедуры

// Серверная функция для получения уровня серьезности
&НаСервереБезКонтекста
Функция ПолучитьУровеньСерьезности(СерьезностьИнцидента)
    Если Не ЗначениеЗаполнено(СерьезностьИнцидента) Тогда
        ЗначениеПоУмолчаню = Константы.ЗначениеПоУмолчанюСерьезностиИнцидента.Получить();
        СерьезностьИнцидента = ?(ЗначениеПоУмолчаню >= 0 И ЗначениеПоУмолчаню <= 999, ЗначениеПоУмолчаню, 100);
    КонецЕсли;

    Если СерьезностьИнцидента >= 800 Тогда
        Возврат "SEV-1";
    ИначеЕсли СерьезностьИнцидента >= 500 Тогда
        Возврат "SEV-2";
    ИначеЕсли СерьезностьИнцидента >= 100 Тогда
        Возврат "SEV-3";
    Иначе
        Возврат "SEV-4";
    КонецЕсли;
КонецФункции
